Repository: ipsavitsky/resume
Catalog: resume.*.po
Languages: ru_ru

source: Ilya Savitsky
ru_ru: Илья Савицкий

source: Dual US and Russian citizenship
ru_ru: Двойное гражданство США/РФ

source: Skills
ru_ru: Навыки

source: Technologies:
ru_ru: Технологии:

source: Languages:
ru_ru: Языки:

source: English (full working proficiency), Russian (native)
ru_ru: Английский (полное рабочее владение), русский (родной)

source: Certifications
ru_ru: Сертификации

source: SQL Course
ru_ru: Курс SQL

source: Certificate
ru_ru: Сертификат

source: Professional technical translator qualification
ru_ru: Сертификат квалификации профессионального переводчика

source: Lomonosov Moscow State University
ru_ru: Московский Государственный Университет

source: Work Experience
ru_ru: Опыт работы

source: Manchester, United Kingdom
ru_ru: Манчестер, Великобритания

source: Software Engineer
ru_ru: Инженер-программист

source: Developed a scalable high performance service used to mirror git objects, including LFS.
ru_ru: Разработан масштабируемый высокопроизводительный сервис, используемый для зеркалирования объектов git, включая LFS.

source: Supported development of Terraform/OpenTofu providers for internal usage.
ru_ru: Поддерживалась разработка поставщиков Terraform/OpenTofu для внутреннего использования.

source: Helped maintain a complex infrastructure product managed with Terraform/OpenTofu.
ru_ru: Помогал поддерживать сложный инфраструктурный продукт, управляемый с помощью Terraform/OpenTofu.

source: Remote, San Francisco CA, USA
ru_ru: Удаленно, Сан-Франциско, Калифорния, США

source: Embedded Software Developer (Contract)
ru_ru: Разработчик Встроенных Систем (Контракт)

source: Developed firmware in C for embedded devices on FreeRTOS using ESP-IDF framework.
ru_ru: Разработал прошивку на C для встраиваемых устройств на FreeRTOS с использованием фреймворка ESP-IDF.

source: Identified and resolved issues in multithread code for enhanced performance and stability.
ru_ru: Выявлял и решал проблемы в многопоточном коде для повышения производительности и стабильности.

source: Streamlined development process by maintaining GitHub Actions build and test pipelines.
ru_ru: Оптимизировал процесс разработки за счет поддержки конвейеров сборки и тестирования GitHub Actions.

source: Moscow, Russia
ru_ru: Москва, Россия

source: Research Software Developer
ru_ru: Техник-программист

source: Conducted groundbreaking research in scheduling theory in collaboration with Huawei, leading to the development of innovative solutions
ru_ru: Провел новаторские исследования в области теории планирования в сотрудничестве с Huawei, что привело к разработке инновационных решений.

source: Designed and implemented highly efficient greedy algorithm in modern C++ for schedule construction.
ru_ru: Разработал и реализовал высокоэффективный жадный алгоритм на современном C++ для построения расписаний.

source: Automated testing and deployment processes by creating Python scripts, resulting in significant time savings.
ru_ru: Автоматизировал процессы тестирования и развертывания за счет создания скриптов Python, что привело к значительной экономии времени.

source: Lomonosov Moscow State University High School
ru_ru: Университетская Гимназия МГУ

source: (secondary employment)
ru_ru: (второстепенная занятость)

source: Tutor
ru_ru: Учитель

source: Developed and taught extracurricular courses ``Introduction in C'' and ``Data visualization'' in informatics, providing students with a solid foundation in programming and data presentation.
ru_ru: Разработал и преподавал внеклассные курсы ``Введение в C'' и ``Визуализация данных'' по информатике, предоставляя ученикам прочную основу в программировании и представлении данных.

source: Implemented a testing system project, enabling students to assess their knowledge and skills effectively.
ru_ru: Реализовал проект системы тестирования, позволяющей студентам эффективно оценивать свои знания и навыки.

source: Successfully established a local code evaluation server, enhancing the efficiency of student evaluation and fostering a collaborative learning environment.
ru_ru: Создал локальный сервер оценки кода, что повысило эффективность оценки учащихся и способствовало созданию среды совместного обучения.

source: Summer Internship, Software developer
ru_ru: Летняя стажировка, Инженер-программист

source: Developed Java microservices and implemented unit testing for optimized code quality.
ru_ru: Разработал микросервисы Java и внедрил модульное тестирование для оптимизации качества кода.

source: Managed and monitored Kubernetes and IBM WebSphere environments to ensure smooth operation and availability.
ru_ru: Управлял средами Kubernetes и IBM WebSphere для обеспечения бесперебойной работы и доступности.

source: Executed basic DevOps tasks to streamline software development and deployment process.
ru_ru: Выполнял основные задачи DevOps для оптимизации процесса разработки и развертывания программного обеспечения.

source: Hackathons
ru_ru: Хакатоны

source: ETHGlobal Brussels. Hyperlane ``Best Infrastructure'' Bounty
ru_ru: ETHGlobal Brussels. Награда Hyperlane ``Лучшая инфраструктура''

source: Showcase
ru_ru: Витрина

source: Brussels, Belgium
ru_ru: Брюссель, Бельгия

source: ETHGlobal Paris. Third place at Axelar bounty
ru_ru: ETHGlobal Paris. Третье место в призе Axelar

source: Paris, France
ru_ru: Париж, Франция

source: Awarded the third-place bounty at ETHGlobal Paris hackathon for developing a cutting-edge smart contract leveraging the Safe\{Wallet\}, Axelar, and Linea blockchain. The smart contract enables users to seamlessly pay partial transaction costs while maintaining security and trustlessness.
ru_ru: Награжден призом за третье место на хакатоне ETHGlobal в Париже за разработку передового смарт-контракта с использованием блокчейна Safe\{Wallet\}, Axelar и Linea. Смарт-контракт позволяет пользователям беспрепятственно оплачивать частичные транзакционные издержки, сохраняя при этом безопасность и надежность.

source: Implemented a robust React-based front-end interface that simplifies the user experience, allowing for seamless interaction with the innovative payment system within the Safe\{Wallet\}.
ru_ru: Реализован надежный фронтенд на основе React, который упрощает работу пользователя и обеспечивает беспрепятственное взаимодействие с инновационной платежной системой в Safe\{Wallet\}.

source: Leaders of digital 2021. Third place
ru_ru: Цифровой Прорыв 2021. Третье Место

source: Innopolis, Russia
ru_ru: Иннополис, Россия

source: Secured third place in the prestigious Russia's largest hackathon, ``Leaders of Digital''. Created a quantum algorithm specifically designed to solve the Traveling Salesman Problem (TSP) on the graph of Moscow Metro on IBM adiabatic annealers.
ru_ru: Занял третье место в престижном крупнейшем хакатоне России «Цифровой прорыв». Создал квантовый алгоритм, специально предназначенный для решения задачи коммивояжера (TSP) на графике Московского метрополитена на адиабатических отжигателях IBM.

source: Qualified in first place
ru_ru: Квалификация на первом месте

source: Secured the first-place position in the highly competitive robot challenge at BRD 2022 by pioneering a cutting-edge computer vision navigation solution. Leveraging a powerful combination of C, Arduino, Python, and OpenCV, developed an advanced system capable of autonomously guiding robots through complex environments with exceptional precision and efficiency.
ru_ru: Занял первое место в высококонкурентном соревновании роботов на выставке BRD 2022, внедрив передовое решение для навигации с помощью компьютерного зрения. Используя мощную комбинацию C, Arduino, Python и OpenCV, мы разработали передовую систему, способную автономно управлять роботами в сложных средах с исключительной точностью и эффективностью.

source: Number.Zone 2022. First place
ru_ru: Цифра.Zone 2022. Первое место

source: Online
ru_ru: Онлайн

source: Emerging as the first-place winner, we leveraged the power of Python and StreamLit, so that our innovative solution seamlessly analyzes and processes images, harnessing advanced artificial intelligence algorithms to recreate detailed 3D representations of iconic landmarks, paving the way for enhanced preservation and immersive virtual experiences.
ru_ru: Заняв первое место, мы использовали возможности Python и StreamLit, чтобы наше инновационное решение беспрепятственно анализировало и обрабатывало изображения, используя передовые алгоритмы искусственного интеллекта для воссоздания детальных 3D-представлений знаковых достопримечательностей, открывая путь к улучшенному сохранению и эффекту погружения. виртуальные впечатления.

source: Personal interests
ru_ru: Личные проекты

source: Developed a Python-based Wikipedia search tool utilizing the Wikipedia API for efficient article retrieval and console-friendly formatting, empowering users to explore a wide range of topics and make informed decisions.
ru_ru: Разработал инструмент поиска в Википедии на основе Python, использующий API Wikipedia для эффективного поиска статей и удобного для консоли форматирования, что дает пользователям возможность исследовать широкий спектр тем и принимать обоснованные решения.

source: Developed a robust Go Cryptobot API wrapper, fortified with comprehensive test coverage, leveraging the power of Telegram API.
ru_ru: Разработал надежную оболочку Go Cryptobot API, дополненную всесторонним тестовым покрытием и использующую возможности Telegram API.

source: Engineered a high-performance Linux shell using C programming language, featuring a recursive descent parser to efficiently parse bash-like syntax into an RPN ``middle interpretation''. Implemented a stack machine for executing the parsed commands, ensuring seamless and reliable execution of complex shell operations.
ru_ru: Спроектировал высокопроизводительную оболочку Linux с использованием языка программирования C, включающую анализатор рекурсивного спуска для эффективного анализа синтаксиса, подобного bash, в ``среднюю интерпретацию'' RPN. Реализован стек-машина для выполнения разобранных команд, обеспечивающая плавное и надежное выполнение сложных операций оболочки.

source: Education
ru_ru: Образование

source: Faculty of Computational Math and Cybernetics, Russia
ru_ru: Факультет Вычислительной Математики и Кибернетики, Россия

source: Bachelor in applied math and informatics, Department of Computing Systems and Automation (GPA 4.4/5.0).
ru_ru: Бакалавр прикладной математики и информатики, кафедра автоматизации систем вычислительных комплексов (GPA 4,4/5,0).

source: Publications
ru_ru: Публикации

source: Link
ru_ru: Ссылка
